app/controllers/api/v1/training_controller.rb

SELECT "trainings".* FROM "trainings" WHERE "trainings"."username" = 2 ORDER BY created_at DESC
---
  def index
      puts("index")
      @training = Training.where('username=?',current_user).order('created_at DESC')

INSERT INTO "trainings" ("comment", "created_at", "distance", "start", "stop", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @training = Training.new
    @training.username = 2
    @training.distance = params[:distance]
    @training.comment = params[:comment]
    @training.start = params[:start]
    @training.stop = params[:stop]

    @training.save

SELECT "trainings".* FROM "trainings" WHERE (username=2)
---
  def update
    @training = Training.where('username=',current_user,:id,params[:id])

SELECT "trainings".* FROM "trainings" WHERE (username=2) ORDER BY created_at DESC
---
  def statistics
    @training = Training.where('username=?',current_user).order('created_at DESC')